common/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;
geom
{
    L 2;
    H 1;
    Nx 30;
    Ny 60;
    y_grading 60;
};

vertices
(
    (0 0 0)
    ($:geom.L 0 0)
    ($:geom.L $:geom.H 0)
    (0 $:geom.H 0)    

    (0 0 0.1)
    ($:geom.L 0 0.1)
    ($:geom.L $:geom.H 0.1)
    (0 $:geom.H 0.1)
);


blocks
(
    hex (0 1 2 3 4 5 6 7)
    ($:geom.Nx $:geom.Ny 1)
    simpleGrading (1 $:geom.y_grading 1)

 
);

edges
(
);

boundary
(
    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        transform translational;
        separationVector ($:geom.L 0 0);
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        transform translational;
        separationVector (#eval{-$:geom.L} 0 0);
        faces
        (
            (1 5 6 2)
            
        );
    }
    symm
    {
        type symmetry;
        faces
        (
            (3 2 6 7)
        );
    }
    
    wall
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }

    front
    {
        type empty;
        faces
        (
            (0 1 2 3)
        );
    }
    
    back
    {
        type empty;
        faces
        (
            (4 7 6 5)
        );
    }


);


// ************************************************************************* //
